["You turn into a rage-filled Dragon lashing out at the nearest creature. You do not change back until you recieve damage.", "You turn into a human with the mind of a dog.", "You gain an aura of poisoned within 20 ft, 1 pt dmg for anyone within the aura, including you.", "You transform into a stone statue of yourself (petrified)", "10 stone statues of you appear in random locations within a 20 foot radius. If they appear in the same location as another creature, that creature takes 2d6 dmg and is knocked prone.", "*(hidden)* You are voodoo bound to a target (DM's choice). Anything that happens to them happens to you.", "*(hidden)* Your touch turns all non-living things to copper", "You grow gills and can only breath underwater", "You are stunned and in extreme pain until you make a Con Save", "Your skin thins to the point where if you get touched at all it tears. Melee dmg doubles", "*(hidden)* You become a magnet to projectiles. Any projectile automatically turns to come toward you", "You turn into the last creature you looked at, including their mind", "Swap 2 random ability scores (D6 1-STR, 2-DEX, 3-CON, 4-INT, 5-WIS, 6-CHA)", "*(hidden)* Every time you make an attack, take 1d4 Force dmg", "*(hidden)* The next ally you speak to gains the Bane effect", "Triple in weight density", "You gain a level of exhaustion", "You go blind", "Your eyes begin shooting streams of flame everywhere you look", "You cannot speak. Only bubbles come out", "You are surrounded by an offensive odor in a 30 foot radius, disadvantage on charisma and stealth", "You start moving in slow motion (half movement speed)", "*(hidden)* You lose proficency for the next proficient skill check you make", "You create a permanent, impenetrable force field around an object or creature (DM's Choice)", "Anything alive is invisible to you. You cannot precieve it in any way.", "A 30-foot cube hypnotic pattern appears with you at the center, causing every living creature in range to walk towards you", "You suddenly realize that you are nothing more than a fictional character in a game played by other creatures in another plane of existence, which causes you to be stunned. This existential crisis lasts until the start of your next turn, after which you shake it off as nonsense.", "Your armor and clothing turn into cardboard. -3 to AC.", "You watch as knowledge literally evaproates from your heads in thin blue streams (Intelligence -2)", "You can only speak to creatures that dislike you", "Your limbs shrink by 50% of their size", "Teleport 1d100 feet straight up", "You are easily influenced. Replace your highest Ability Score with nearest Ally's lowest ability score", "Uncontrollable sobbing", "You are now late to everything. You always go last in initiative", "You become highly sensitive to sunlight, taking 10 dmg per hour of sunlight you are exposed to", "Your clothes become animated and try to strangle you", "Your hands become so sticky that you cannot let go of anything you touch", "All metal objects within 30 feet become magnetically repelled by you", "All metal objects within 30 feet become magnetically attracted to you", "You teleport one of your allies to a dangerous location *(DM's Choice)*", "Your body becomes engulfed in flames and you are incapaciated.", "Your muscles weaken,  Strength -1", "Gain a wish spell that gets distorted into something terrible upon use", "All water you touch turns to blood", "Develop an irrational anger toward your own reflection. You cannot help but attack if you see yourself.", "Your fingers turn into snakes that are trying to kill you", "The ground beneath you in a 10 foot radius turns to quicksand", "Your skin becomes liquid and your internal organs threaten to fall out.", "You gain the ability to fly, (*hidden*) but over 30ft you fall all the way to the ground", "Bubble in one death saving throw", "Your toes fall off. -2 to Dexterity.", "Your shadow becomes sentient and tries to flee from you dragging you wherever it goes", "A swarm of tiny blue dwarfs engulfs you, obscuring your vision", "Any magical effects created by your party, inluding all spells cast during the current round, cease to function or their effects are reversed", "Your eyes turn solid black. You can now only see in complete darkness.", "You drop to 1 hp and your attack dmg is now equal to your curent hp", "*(hidden)* Your reflection tries to murder you whenever it sees you", "*(hidden)* All your actions are mirrored by the rest of your party. If you commit an action they cannot perform, they go through the motions with no effect.", "The next target you kill comes back to life after 1 hour with a life long vengance to hunt you down and kill you", "Insects are drawn to you, swarming around you", "2 magic missle fire at each of your party members", "Your mind is flooded with random, uncontrollable thoughts", "Your allies all desperately want to have sex with you and are violently jealous of each other", "All sounds within 30 feet of you are amplified to painful levels", "*(hidden)* Your head alternates between shrinking to half its size, then growing twice its size every 6 seconds", "You are surrounded by eerie whispers that only you can hear", "Your voice becomes a high-pitched squeak", "Your body becomes covered in a thick layer of slime, disadvantage on DEX skills", "Everything within 20 ft is pulled up to 10 ft toward you", "All food within 30 feet spoils instantly", "You shrink to half your size", "You lose the ability to understand spoken languages", "Your feet become glued to whatever they are touching", "Everyone in a 20 foot radius, except you, is thrown 200 ft in the air", "Your allies start uncontrollably dancing", "Each party member points out a separate, but deeply held, insecurity of yours. You lose 1/3 of your CHA ability points.", "Any non-living objects smaller than you levitate around you", "Your hands turn into glass. Any time you use your hands, roll 1d10. If you get 3 or less, your hands shatter", "2 pouches of tobacco appear in your bag, and you are now a 2 pack a day smoker. - 2 to Constitution.", "You becomes extremely sensitive to temperature, causing discomfort and whinyness (1 pt dmg/round) in heat or cold", "Your ear falls off and you have leprosy (-2 hp per 6 seconds)", "The last bad wild magic effect re-activates", "A duplicate of you appears and immediately tries to convince the party you are an imposter", "A duplicate of you appears and won't stop trying to have sex with you", "Your blood glows red. Any action you take other than movement will result in another wild magic surge", "A duplicate of you appears and tells everyone in earshot one of your darkest secrets", "A magic item in your party's possesion become mundane", "You are at the center of a darkness spell", "You randomly teleport on top of things every 6 seconds", "Your blood turns black. Flip your next Light WMS for a Dark WMS.", "You randomly teleport inside of any container within 30 ft large enough to hold you", "You uncontrollably shadow a random ally's actions. If they commit an action you cannot perform, you go through the motions with no effect", "You are frightened by the nearest creature", "You forget everything that has happened within the last hour", "Inanimate objects randomly come to life around you and try to attack you", "You forget everything that has happened within the last 24 hours", "You draw 2 hit dice of hp from each ally, whether you need it or not", "You have a full case of Amnesia. You do not remember who you are or what you are doing", "(*hidden from party*) You have to lie. You cannot tell the truth.", "(*hidden*) The next apparopriate word you say becomes reality, regardless of the consequences", "Your body becomes covered in colorful, glowing mushrooms", "You polymorph into a creature of your choice no bigger than a cat", "Your voice echoes with a booming supernatural tone", "Your hair becomes tangled and impossible to groom", "All your teeth turn into worms", "Your hair immediately falls out and regrows as colorful feathers", "You go back in time 1d20x1d4 years for 6 seconds.", "Inanimate objects begin to aggressively probe into your personal life.", "Your clothes animate and start mocking you, but only you can hear them", "You turn into the last creature you looked at, you retain your mind.", "A random creature within 30 feet of you gains a flying speed equal to its walking speed. If it is still in the air when the minute is up, it falls taking dmg.", "Grow a third eye on your forehead. It provides no advantage.", "Your body becomes translucent", "A demon equal to your level appears next to you and amkes a Charisma saving throw. If it fails, it becomes your familiar, if it succeeds, it immediately attacks you and your allies.", "Swap 2 ability scores of your choosing. You must swap.", "A deck of many things appears hovering in front of you expectantly, only visible and touchable by you. It disappears at the end of your next turn.", "Speak only in rhymes", "You turn into a dragonborn and can only speak draconic", "A talking spectral fish floats near you giving useless advice. Everyone can see and hear it.", "You can now sustain up to d4 concentration spells.", "Your skin changes to a marble appearance, but is still flesh", "Anyone you speak to casts Friend on you", "Everything you touch turns to gold for 6 seconds, then reverts", "You occasionally freeze in place for a random amount of time", "Your skin thickens, restore any AC you have lost", "You grow antlers, fur, and horns, and can talk to small animals", "You grow a tail you can control.", "Blindly swap 2 ability scores of a target of your choice", "You gain the cantrip: True Strike", "You gain the cantrip: Light", "You gain the cantrip: Mending", "You gain the cantrip: Longstrider", "You gain the cantrip: Jump", "You gain the cantrip: Gust", "You gain the cantrip: Control Flames", "Your eyes turn white with a subtle glow, and you can now see lies", "You fall asleep", "Gain a +1 to one ability score of your choice and -1 to another *[DM's Choice]*", "You can leviate 10ft, but your movement speed is reduce to 10 ft", "You grow noticeably taller or shorter *[DM's Choice]*", "You must sprint everywhere you go (+10 movement speed, +1 exhaustion", "Your muscles swell, grow. You look incredible musicular and well defined, but you stats remain the same", "\"Clumsy\" constantly tripping/ dropping things", "Everything hurts when it touches you", "You can no longer read/write/domath/count", "You believe most anything you're told", "You become incredibly attractive, but creep everyone out canceling out any benefit", "Any flammable item you touch bursts into flames", "Any liquid item you touch instantly freezes", "Any inanimate item you touch instantly comes to life", "You are afrald of a random ally,feel scared/paranoid", "You suffer the effects of Modify Memory *[DM's Choice]*", "You forget who one of your party members are temporarily", "You are absolutely convinced one of your party members is secretly trying to kill you in the next 24 hours", "You get confused easily and have to be told everything 2-3 times betore it make sense", "You can only say very hurtful things", "You can only say very kind things", "You can only speak by repeating thing said around you in the last 10 minutes", "You feel compelled to insult everyone you meet or take 2 psychic damage", "Gain the favor of a random NPC", "You hear the thoughts of a random creature within 30 feet", "You get a vision of the past", "You get a vision of the future", "You start to hear voices from one of the items on your person..and think is sentient (DMsecret.. it's not)", "Surge of energy flows through your body and your eyes begin to glow. Something happens (present/future) based on the PC's desires *[DM Choice]*", "Everytime you lie your eyes glow a golden yellow", "You have a vision of an important story element/key info", "You gain the service of an unseen servant", "You feel like you can tell the future, but you can't [DM lies to PC]", "You gain an floating arcane eye that you can see through, but your eyes are now blind", "Every creature within 15 feet takes 2 necrotic damage. You regain half your lost health.", "Every creature within 15 feet takes 2 fire damage. You regain a sourcery point.", "Cold feet: Every creature within 15 feet takes 2 cold damage. You regain a spell slot of any level.", "Atomic fart: Every creature within 15 feet takes 2 force damage and is knocked prone.", "You can cure one disease or effect", "You can inflict one disease or effect", "Make a death daving throw and permanently bubble in the result", "Make a random saving throw. No outcome, just anticipation and fear.", "The next enemy you target dies within 20 seconds (3 rounds)", "The next enemy you kill haunts you and your party for 24 hours", "You must touch an ally every 1 minute or fall unconsious. An ally touching you brings you back to consciousness at 1 HP", "(DM chooses target) You now must act like and be like that person, doing everything they do", "You constantly heal for 1 HP every 6 seconds", "You immediately gain 20 temporary hit point sshield", "Any magic cast around you has an opposite effect *[DM determines opposite effect]*", "Any magic cast around you has a random effect *[DM determines random effect]*", "Any magic cast around you has an additional effect *[DM determines additional effect]*", "You are now trapped inside a magical Shield. You cannot be damaged, but you cannot escape.", "You gain the ability to speak with animals", "Illusory butterflies and flower petals flutter in the air around you in a 10-foot radius for 1 minute.", "Pies appear and fall out of the air around you in a 10-foot radius for 1 minute.", "Spiders swarm around you in a 10-foot radius for 1 minute.", "The next thing you touch creates an illusion of your mouth on it. You can only speak from it now.", "The next thing you touch creates an illusion of your nose on it. You can only smell from it now.", "The next thing you touch takes control of your mouth. It can only speak through your mouth.", "You make no sound of any kind", "You can make an ally fundamentally believe 1 untrue thing", "You switch souls with a random creature within 30 feet of you. You control it, and it controls you.", "(*hidden*) DM's Choice to be triggered at a awesome moment", "You can cast MAGIC MISSLE as a 5th level spell", "You gain +2 to DEX", "You gain +2 to WIS", "You gain +2 to CON", "You gain +2 to STR", "You gain +2 to INT", "You are impossibly attractive to everyone you meet. You gain +2 to CHA", "An ally of your choice gains +2 to CHA", "An ally of your choice gains +2 to INT", "An ally of your choice gains +2 to STR", "An ally of your choice gains +2 to CON", "An ally of your choice gains +2 to WIS", "An ally of your choice gains +2 to DEX", "You and all allies within 30ft of you gain invulnerability to piercing damage", "Your enemies are suddenly intoxicated by alcohol", "The nearest enemy is frightened of you", "All enemies are frightened of you", "Any enemy that ends its turn within 5ft of you is blinded", "You regain all your hp", "You gain 15 temp hp", "Overwrite 1 ability score of your choosing with another ability score", "You gain 25 temp hp", "Your allies gain 15 temp hp", "An ally of your choice gains 50 temp hp", "Your ally's status effects are cured", "You gain 5hp at the start of each of your turns", "Your allies gain 2hp at the start of each of their turns", "You can grow and shrink at will", "you can teleport up to 20ft as a bonus action on each of your turns.", "You gain 1 additional spell slot at lvl 1", "You gain 1 additional spell slot at any lvl", "You refill your spell slots", "You can use any spell slot to cast a spell at the highest level", "You do not use spell slots when you cast a spell", "You can teleport another creature anywhere within 1000ft of you", "You gain resistance to all damage", "You gain resistance to fire damage", "You gain resistance to cold damage", "You gain resistance to disease", "You gain resistance to poison", "You gain resistance to fear", "You gain resistance to blindess", "You can see in complete darkness", "You can see up to a mile away", "You can see through objects up to 6ft thick (*stacking*)", "You gain mirror image as a cantrip", "You can polymorph into a Giant Dragonfly", "You can polymorph into a Small Stone Dragon", "You can polymorph into a mouse", "You can polymorph into anyone you have seen in person", "You can cast LEVITATE as a cantrip", "You can cast CONFUSION as a cantrip", "all your spells with a casting time of 1 action now have a casting time of 1 bonus action", "You can cast FLY on a creature of your choice within 60ft of you", "You gain +2 to AC", "Your allies gain +2 to their AC", "You can learn a new spell of your choosing (*no restrictions*)", "A creature of your choice is stuck in place", "A creature of you choice reverts to a baby", "A creature of you choice falls in love with another creature of your choice", "A creature of your choice follows any one command you give it", "Any time you gain advantage, you have double advantage", "You never have disadvantage", "You gain advantage on every attack roll", "You gain advantage on every saving throw", "You gain advantage on proficient ability checks", "The last good wild magic effect re-activates", "The last 2 positive wild magic effects re-activate", "Your enemies fall in love with you", "Your weapons beome animated and you can command them (*same stats as flying sword*)", "Your enemies weapons beome animated and you can command them (*same stats as flying sword*)", "You summon a horde of 1 inch blue dwarfs that will swarm an enemy of your choosing, paralyzing it", "You grow 2 new arms, giving you 1 additional action and bonus action", "You can change the weather at will", "You can make it rain acid in a location of your choosing that you can see", "10000 ball bearings fall to the ground at a location of your choosing", "You become a shadow, and gain *Amorphous* and *Shadow Stealth*", "You can project a giant, realistic image of your face in the sky at will", "Cast Dimension Door as a cantrip", "Your blood glows purple. Any action you take other than movement will result in another wild magic surge", "Your blood glows orange. The start of each combat encounter will trigger a wild magic surge", "Your blood glows blue. You can choose to accept or decline the next Wild Magic Surge", "Your blood glows white. You can flip your next Dark WMS for a Light WMS", "You gain the lay on hands feature (level appropriate)", "A huge energy surge centered from you fully heals all allies within 30 ft", "All allies can add +1 to any skill but it will cost you +1 ability point.", "All allies gain 30 temp hp", "You can negate individual magical effects around you that you can identify", "You can cast any spell at any level", "You can freely cast shield as reaction", "You turn invisible", "A phantasmal horse appears that you can ride through solid objects", "You can concentrate on any number of spells", "You never break concentration", "Your spells no longer have time limits (while this effect lasts)", "You cast mirror image and it doesn't require concentration", "Anyone you speak to must make a wisdom saving throw or have Friend cast on them", "You can throw your voice anywhere in the world", "You can go invisible at will as a BA", "(*hidden*) DM's Choice to be triggered at a beneficial moment"]